using UnityEngine;
using System.Collections;

public class OpenPlatChat : ChatTextController
{
    void Awake()
    {
        mData = new string[8]{"大姐头：狗贼ヾ(≧へ≦)〃！说好的一起装B你TM一个人全装了,敢一个人抢走坤臀。\n快把坤臀交出来！！！！",
        "颓废翔：哈哈哈哈哈哈哈哈，我颓废翔什么大风大浪没见过，你说交就交多没面子，小爷我可是厦大的！！",
        "大姐头：为了宇宙的和平，世界的正义，今天我们只有一个人能活着走出去！",
        "颓废翔：小伙子很天真啊，想要碰我，先问问我的马仔们。",
        "大姐头：虽然姐不在江湖多年，但江湖仍然有姐的传说。是时候展现真正的技术了！",
        "颓废翔：哦？你知道怎么操作么？",
        "大姐头：So Easy,左手边的摇杆能让我向各个方向移动，右手边的按钮可以让我进行不同的攻击，搞死你的马仔作者还给奖励！！今天先拿你的马仔开刀！！！",
        "颓废翔：看你有多大能耐，三十六计，走为上。皮皮虾，我们走！！"};
    }
}